<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group-k8s"
      ~ release_version        = "1.34.1-20251016" -> "1.34.1-20251023"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-staging"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
        }
        # (17 unchanged attributes hidden)
        # (3 unchanged blocks hidden)
    }
  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX|terraform-20251027185645119400000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20251027185645119400000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
Plan: 1 to add, 1 to change, 1 to destroy.

# --- End of Plan 1 ---